# Utiliser Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps

# Définir où placer les applications installées
# cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Outils système et réseau
# brew 'appcleaner'
# brew 'openssh'
# brew 'gcc'
# brew 'ssh-copy-id'
# brew 'openssl'
# brew 'rsync'
brew 'wget'
brew 'curl'
brew 'Cyberduck'
# brew 'postman'
# brew 'ngrok'

# Outils pour le terminal
brew 'iterm2'
brew 'autojump'
brew 'thefuck'
# brew 'trash'
# brew 'mcfly'

# Utilitaires
# cask 'ccleaner'
# cask 'imageoptim'
brew 'coconutbattery'
# cask 'GrandPerspective'
# cask 'hiddenbar'
# cask '1password'
brew 'keyboard-cleaner'

# Quicklook For README, INSTALL, Rakefile, Makefile…
# cask 'qlstephen'
# Quicklook for webp
# cask 'webpquicklook'
# Quicklook for other formats
# cask 'qlmarkdown'
# cask 'quicklook-csv'
# cask 'quicklook-json'

mas 'BetterSnapTool', id: 417_375_580
# cask 'the-unarchiver'
# cask 'android-file-transfer'
# cask 'rocket'
# cask 'github-desktop'
# cask 'meld'

# Outils de backup et synchro
brew 'mackup'
# cask 'carbon-copy-cloner'
# cask 'google-backup-and-sync'
# cask 'dropbox'

# Navigateurs
# cask 'firefox'
# cask 'firefox-developer-edition'
# cask 'google-chrome'
# cask 'google-chrome-canary'
# cask 'safari-technology-preview'
# cask 'microsoft-edge-dev'
# brew 'lynx'
# cask 'brave'
# cask 'vivaldi'

# Outils de développement
brew 'git'
# brew 'gh'
# cask 'java'
# cask 'java6'
# brew 'pkg-config'
# brew 'ruby'
# brew 'python3'
# brew 'composer'
# brew 'php71', args: ['with-httpd24']


# brew 'nvm'
# brew 'volta'

# cask 'visual-studio-code'

# Fonts
# cask 'font-fira-code'
# cask 'font-jetbrains-mono'
# cask 'font-dejavu-sans-mono-for-powerline'
# cask 'font-libre-baskerville'
# cask 'font-microsoft-office'
# cask 'font-open-sans'

# Static generators
# brew 'hugo'

# Traitement d'image
# brew 'graphicsmagick'
# brew 'gsl'
# brew 'exiftool'
brew 'imagemagick'
# mas 'Boxy SVG', id: 611658502
# brew 'jhead'
brew 'webp'
# brew 'gimp'

# Multimédia
# brew 'ffmpeg', args: ['with-libvpx', 'with-openh264', 'with-theora', 'with-fdk-aac', 'with-opus', 'with-frei0r']
brew 'ffmpeg'
brew 'yt-dlp'
brew 'vlc'

# Communication
# brew 'slack'

# a11y
brew 'karabiner-elements'


# Bureautique
# brew 'libreoffice'
brew 'pandoc'
