# Utiliser Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps

tap 'homebrew/dupes'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/homebrew-php'
tap 'caskroom/drivers'
tap 'colindean/fonts-nonfree'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Outils système et réseau
cask 'appcleaner'
brew 'openssh'
brew 'gcc'
brew 'ssh-copy-id'
brew 'openssl'
brew 'rsync'
brew 'wget'
brew 'curl'
cask 'Cyberduck'
# brew 'stormssh'
# cask 'tunnelblick'
cask 'postman'
# cask 'ngrok'
cask 'timemachineeditor'

# Outils pour le terminal
cask 'iterm2'
brew 'autojump'
brew 'thefuck'
brew 'rmtrash'

# Utilitaires
cask 'ccleaner'
cask 'imageoptim'
cask 'coconutbattery'
cask 'GrandPerspective'
# cask '1password'

# Quicklook For README, INSTALL, Rakefile, Makefile…
cask 'qlstephen'
# Quicklook for webp
cask 'webpquicklook'
# Quicklook for other formats
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'

mas 'BetterSnapTool', id: 417_375_580
cask 'the-unarchiver'
cask 'android-file-transfer'
cask 'rocket'
# cask 'github-desktop'
cask 'meld'

# Outils de backup et synchro
brew 'mackup'
cask 'timemachineeditor'
# cask 'carbon-copy-cloner'
cask 'google-backup-and-sync'
cask 'dropbox'

# Navigateurs
cask 'firefox'
cask 'FirefoxDeveloperEdition'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'safari-technology-preview'
cask 'microsoft-edge-dev'
# brew 'lynx'
# cask 'brave'
# cask 'vivaldi'

# Outils de développement
brew 'git'
cask 'java'
cask 'java6'
brew 'pkg-config'
brew 'ruby'
brew 'python3'
# brew 'composer'
# brew 'php71', args: ['with-httpd24']

# cask 'docker'
# cask 'kitematic'
# brew 'docker-clean'

# brew 'ansible'
# cask 'vagrant'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'

brew 'nvm'
brew 'yarn', args: ['without-node']

cask 'visual-studio-code'
cask 'font-fira-code'

cask 'sequel-pro'
# mas 'Xcode', id: 497799835

# Static generators
brew 'hugo'

# Traitement d'image
brew 'graphicsmagick'
brew 'gsl'
brew 'exiftool'
brew 'imagemagick@6'
mas 'Boxy SVG', id: 611658502
cask 'imageoptim'
brew 'jhead'
brew 'webp'

# Multimédia
brew 'ffmpeg', args: ['with-libvorbis', 'with-libvpx', 'with-openh264', 'with-theora', 'with-fdk-aac', 'with-opus', 'with-frei0r']
brew 'youtube-dl'
# cask 'handbrake'
mas 'giski', id: 1351639930
cask 'spotify'
cask 'vlc'
mas 'filebot', id: 905384638
# cask 'calibre'

# Screen video capture
cask 'kap-beta'
# Black out parts of images
# mas 'black-out', id: 1319884285

# Communication
# cask 'rambox'
cask 'slack'
cask 'discord'
casl 'mattermost'
# cask 'skype'
# mas 'trello', id: 1278508951

# Bureautique
cask 'thunderbird-beta'
cask 'libreoffice'
brew 'pandoc'
cask 'flux'
# cask 'poedit'
cask 'font-microsoft-office'
mas 'trello-organize-anything', id: 1278508951

# Divertissement

# Securite
brew 'gpg2'
